/*******************************************************************************
  
  [File name]  : \\OLT\
  [Author]     : bin.wang
  [Version]    : 1.0
  [Date]       : 2017-06-10
  [Description]:

  [Others]     :

  [Function List]:
	1. ....
	2. ....
  [History]:
	 D a t e	Modification										  Initials
	---------- --------------										 ----------
	2010-06-10	Created 											  bin.wang
*******************************************************************************/
#if 0

#ifndef __BCAPI_IGMP_FWD_H__
#define __BCAPI_IGMP_FWD_H__

////////////////////////////////////////////////////////////////////////////////
//																			  //
//								头   文   件								  //
//																			  //
////////////////////////////////////////////////////////////////////////////////
#include "bc_common_defs.h"
#include "bc_igmp_def.h"
/*
////////////////////////////////////////////////////////////////////////////////
//																			  //
//								宏   定   义								  //
//																			  //
////////////////////////////////////////////////////////////////////////////////
#define OLT_IGMP_FWD_CFG_MAX_COUNT	1024
#define ONU_IGMP_FWD_CFG_NUMBER		64

////////////////////////////////////////////////////////////////////////////////
//																			  //
//					结 构 体 、联 合 体、枚 举 定 义				  		  //
//																			  //
////////////////////////////////////////////////////////////////////////////////
typedef struct
{
	bc_uint16			vid;
	bc_ipv4				ip;
	bc_port_index_t	    port_list[BC_PORT_PON_MAX_COUNT];		// 端口数量与OLT的PON数量一致，暂不支持ONU，直接读取设备可以得到相应参数值。
} bcep_igmp_fwd_t;
*/

////////////////////////////////////////////////////////////////////////////////
//																			  //
//						外 部 变 量、 函 数 声 明					  		  //
//																			  //
////////////////////////////////////////////////////////////////////////////////
bc_err_e bc_query_igmp_fwd(bc_igmp_fwd_t igmp_fwd[BC_IGMP_OLT_FWD_CFG_MAX_COUNT], bc_int32 *num);
#endif /* __BCAPI_IGMP_FWD_H__ */

#endif
