/*******************************************************************************
  Copyright (C), 1988-2012, xxxxx Tech. Co., Ltd.
  [File name]  : \\BC\ktapi_sys_global_info.c
  [Author]     : wangbin
  [Version]    : 1.0
  [Date]       : 2012-06-11
  [Description]:

  [Others]     :

  [Function List]:  
    1. ....
    2. ....
  [History]:
	 D a t e    Modification 										  Initials
	---------- --------------                                        ----------
	2014-06-03  Created												  wangbin
*******************************************************************************/

#ifndef __BC_FILETRANS_FILE_H__
#define __BC_FILETRANS_FILE_H__

////////////////////////////////////////////////////////////////////////////////
//																			  //
//								头   文   件								  //
//																			  //
////////////////////////////////////////////////////////////////////////////////

#include "bc_err.h"
#include "bc_filetrans_def.h"
//#include "bc_modules_com_para.h"

////////////////////////////////////////////////////////////////////////////////
//																			  //
//								宏   定   义								  //
//																			  //
////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////
//																			  //
//					结 构 体 、联 合 体、枚 举 定 义						  //
//																			  //
////////////////////////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////////////////////////
//																			  //
//						外 部 变 量、 函 数 声 明							  //
//																			  //
////////////////////////////////////////////////////////////////////////////////

/* 初始化 */
bc_err_e bc_filetrans_init(void);

/*获取文件传输参数*/
bc_err_e bc_filetrans_get_info(bc_filetrans_function_e trans_fun, bc_filetrans_cfg_t *para);

/*下载设置*/
bc_err_e bc_filetrans_set_download_file(bc_filetrans_cfg_t para);

#endif /* __BC_FILETRANS_FILE_H__ */




