/*******************************************************************************
 * Copyright(C) 2011, Kingtype Networks Corporation. All rights reserved.
 *
 * This is unpublished proprietary source code of Kingtype Networks Corporation.
 *
 * The copyright notice above does not evidence any actual or intended
 *	publication of such source code.
*******************************************************************************/
/*==============================================================================
 * MODULE NAME: Banner
 * FILE NAME  : bc_cli_bnr_cmd.h
 * VERSION    : 1.0.0
 * DESCRIPTION: Commands for greeting message and command promt register here
 * NOTES:
 *
 * HISTORY:
 * -----------------------------------------------------------------------------
 * Version 1.0
 * [NEW FEATURE]
 * <DESCRIPTION>
 *============================================================================*/

#ifndef  __BC_CLI_BNR_CMD_H__
#define  __BC_CLI_BNR_CMD_H__

////////////////////////////////////////////////////////////////////////////////
// 								    										  //
// 							    头   文   件								  //
// 										    								  //
////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////
//																			  //
//						结   构   体   宏   定   义							  //
//																			  //
////////////////////////////////////////////////////////////////////////////////



////////////////////////////////////////////////////////////////////////////////
//																			  //
//								函	数	声	明								  //
//																			  //
////////////////////////////////////////////////////////////////////////////////

/*------------------------------------------------------------------------
 * Function:   BOOL_T bc_cli_bnr_cmd_reg (void)
 * Parameters: None
 *    Input:   None
 *    Output:  None
 * Returns:    None
 *------------------------------------------------------------------------
 */
BOOL_T bc_cli_bnr_cmd_reg(void) ;



#endif /* __BC_CLI_BNR_CMD_H__ */
